{
  "support_tickets_metadata": {
    "source": "Customer Support System",
    "date_range": "March 2024",
    "total_tickets": 50,
    "product": "SaaS Platform"
  },
  "tickets": [
    {
      "ticket_id": "T001",
      "date": "2024-03-01T10:23:45Z",
      "user_id": "U6001",
      "priority": "High",
      "status": "Resolved",
      "category": "Technical Issue",
      "subject": "Can't log in - password reset not working",
      "description": "I've been trying to reset my password for 2 days now. I click 'Forgot Password', enter my email, but I never receive the reset link. I've checked my spam folder, tried multiple times, nothing works. I need to access my account urgently for work. Please help!",
      "response": "We've identified an issue with our email delivery system. I've manually reset your password and sent it to your email. You should be able to log in now. We're working on fixing the automated system.",
      "resolution_time_hours": 4,
      "satisfaction_rating": 3
    },
    {
      "ticket_id": "T002",
      "date": "2024-03-01T14:12:33Z",
      "user_id": "U6002",
      "priority": "Medium",
      "status": "Resolved",
      "category": "Feature Request",
      "subject": "Need ability to export data in Excel format",
      "description": "I need to export my project data to Excel for reporting, but the current export only supports CSV. CSV doesn't preserve formatting, and I have to manually reformat everything. Can you add Excel export? This would save me hours every week.",
      "response": "Thank you for the feedback. We've added Excel export to our roadmap and will prioritize it for a future release. In the meantime, you can use Excel to open CSV files and apply formatting.",
      "resolution_time_hours": 24,
      "satisfaction_rating": 4
    },
    {
      "ticket_id": "T003",
      "date": "2024-03-02T09:45:21Z",
      "user_id": "U6003",
      "priority": "High",
      "status": "Resolved",
      "category": "Bug Report",
      "subject": "App crashes when I try to upload large files",
      "description": "Every time I try to upload a file larger than 50MB, the app crashes. This happens on both web and mobile. I've tried different file types, different browsers, nothing works. I need to upload large files for my work. This is blocking me.",
      "response": "We've identified a memory issue when handling large file uploads. We've deployed a fix that should resolve this. Please try uploading again and let us know if you still experience issues.",
      "resolution_time_hours": 8,
      "satisfaction_rating": 5
    },
    {
      "ticket_id": "T004",
      "date": "2024-03-02T11:23:56Z",
      "user_id": "U6004",
      "priority": "Low",
      "status": "Open",
      "category": "Question",
      "subject": "How do I share a project with someone who doesn't have an account?",
      "description": "I want to share a project with a client, but they don't have an account. Is there a way to share it with them without requiring them to sign up? I don't want to force them to create an account just to view something.",
      "response": "Currently, all collaborators need to have an account. However, you can export the project as a PDF and share that. We're working on a guest access feature that will be available in a future release.",
      "resolution_time_hours": 12,
      "satisfaction_rating": 2
    },
    {
      "ticket_id": "T005",
      "date": "2024-03-03T15:34:12Z",
      "user_id": "U6005",
      "priority": "High",
      "status": "Resolved",
      "category": "Billing",
      "subject": "Charged twice for my subscription",
      "description": "I was charged twice for my monthly subscription this month. I only have one account, so this shouldn't have happened. I've checked my bank statement, and there are definitely two charges. Please refund one of them immediately.",
      "response": "We apologize for the error. We've identified a duplicate charge issue and refunded the second charge. The refund should appear in your account within 3-5 business days. We've also fixed the underlying issue to prevent this from happening again.",
      "resolution_time_hours": 2,
      "satisfaction_rating": 4
    },
    {
      "ticket_id": "T006",
      "date": "2024-03-03T16:45:33Z",
      "user_id": "U6006",
      "priority": "Medium",
      "status": "Resolved",
      "category": "Feature Request",
      "subject": "Need dark mode",
      "description": "I use this app all day, and the bright white background is hard on my eyes. Can you add a dark mode? This would make such a difference for my comfort. I know it's not a critical feature, but it would really improve my experience.",
      "response": "Thank you for the suggestion! Dark mode is on our roadmap and we're planning to release it in the next major update. We'll notify you when it's available.",
      "resolution_time_hours": 48,
      "satisfaction_rating": 5
    },
    {
      "ticket_id": "T007",
      "date": "2024-03-04T10:12:44Z",
      "user_id": "U6007",
      "priority": "High",
      "status": "Resolved",
      "category": "Technical Issue",
      "subject": "Sync is broken - changes not saving",
      "description": "I made changes to a project on my laptop, but when I opened it on my phone, the changes weren't there. I've tried refreshing, logging out and back in, nothing works. The sync is completely broken. I've lost work because of this.",
      "response": "We've identified a sync issue affecting some users. We've deployed a fix and your changes should now sync properly. Please try making a change and let us know if you still experience issues.",
      "resolution_time_hours": 6,
      "satisfaction_rating": 3
    },
    {
      "ticket_id": "T008",
      "date": "2024-03-04T13:56:21Z",
      "user_id": "U6008",
      "priority": "Low",
      "status": "Open",
      "category": "Question",
      "subject": "Is there a way to bulk delete items?",
      "description": "I have hundreds of old items I want to delete, but I have to delete them one by one, which takes forever. Is there a way to select multiple items and delete them all at once? This would save me so much time.",
      "response": "Currently, bulk delete is not available, but it's a feature we're planning to add. In the meantime, you can use our API to bulk delete items programmatically. I can send you documentation if you're interested.",
      "resolution_time_hours": 18,
      "satisfaction_rating": 2
    },
    {
      "ticket_id": "T009",
      "date": "2024-03-05T09:23:45Z",
      "user_id": "U6009",
      "priority": "High",
      "status": "Resolved",
      "category": "Bug Report",
      "subject": "Notifications not working",
      "description": "I've set up notifications for important events, but I never receive them. I've checked all my settings, everything is enabled, but still nothing. I'm missing important updates because of this. Please fix this ASAP.",
      "response": "We've identified an issue with our notification system. We've fixed it and you should now receive notifications properly. You may need to re-enable notifications in your settings.",
      "resolution_time_hours": 4,
      "satisfaction_rating": 4
    },
    {
      "ticket_id": "T010",
      "date": "2024-03-05T14:34:12Z",
      "user_id": "U6010",
      "priority": "Medium",
      "status": "Resolved",
      "category": "Feature Request",
      "subject": "Need keyboard shortcuts",
      "description": "I use this app all day, and I'm constantly clicking around. If I could use keyboard shortcuts for common actions, I'd be so much faster. Even basic ones like Cmd+S to save, Cmd+N for new, that kind of thing.",
      "response": "Great suggestion! Keyboard shortcuts are available - you can see them by pressing Cmd+? (or Ctrl+? on Windows). We're also planning to add more shortcuts in future updates.",
      "resolution_time_hours": 6,
      "satisfaction_rating": 5
    },
    {
      "ticket_id": "T011",
      "date": "2024-03-06T11:45:33Z",
      "user_id": "U6011",
      "priority": "High",
      "status": "Resolved",
      "category": "Technical Issue",
      "subject": "Can't access my account - says it's been suspended",
      "description": "I tried to log in today and got a message saying my account has been suspended. I have no idea why - I haven't done anything wrong. I need access to my account for work. This is urgent. Please help!",
      "response": "We apologize for the error. Your account was incorrectly flagged by our automated system. We've restored your access and you should be able to log in now. We're reviewing our system to prevent this from happening again.",
      "resolution_time_hours": 3,
      "satisfaction_rating": 3
    },
    {
      "ticket_id": "T012",
      "date": "2024-03-06T16:12:44Z",
      "user_id": "U6012",
      "priority": "Low",
      "status": "Open",
      "category": "Feature Request",
      "subject": "Want to customize dashboard layout",
      "description": "I want to be able to customize my dashboard to show what's important to me. Right now it shows everything, but I only care about a few things. Can you add the ability to customize the layout?",
      "response": "Thank you for the feedback. Dashboard customization is on our roadmap. In the meantime, you can use filters to focus on what's important to you.",
      "resolution_time_hours": 24,
      "satisfaction_rating": 3
    },
    {
      "ticket_id": "T013",
      "date": "2024-03-07T10:23:56Z",
      "user_id": "U6013",
      "priority": "High",
      "status": "Resolved",
      "category": "Bug Report",
      "subject": "Data loss after update",
      "description": "After the latest update, I lost all my data. Everything is gone - projects, settings, everything. I've tried restoring from backup, but the backup is also empty. This is catastrophic. I've lost months of work. Please help!",
      "response": "We're very sorry about this. We've identified a critical bug in the update that affected some users. We've restored your data from our servers. You should see all your data now. We're also providing you with 3 months of free service as compensation.",
      "resolution_time_hours": 12,
      "satisfaction_rating": 2
    },
    {
      "ticket_id": "T014",
      "date": "2024-03-07T14:45:21Z",
      "user_id": "U6014",
      "priority": "Medium",
      "status": "Resolved",
      "category": "Question",
      "subject": "How do I integrate with Slack?",
      "description": "I want to get notifications in Slack when things happen in the app. Is there a way to integrate with Slack? I saw something about integrations but I'm not sure how to set it up.",
      "response": "Yes, we have a Slack integration! You can set it up by going to Settings > Integrations > Slack. There's a step-by-step guide there. If you need help, let me know.",
      "resolution_time_hours": 2,
      "satisfaction_rating": 5
    },
    {
      "ticket_id": "T015",
      "date": "2024-03-08T09:34:12Z",
      "user_id": "U6015",
      "priority": "High",
      "status": "Resolved",
      "category": "Technical Issue",
      "subject": "App is extremely slow",
      "description": "The app has become extremely slow over the past week. It takes 30+ seconds to load pages, and actions are delayed. This is making it unusable. I've tried different browsers, cleared cache, nothing helps. Please fix this.",
      "response": "We've identified a performance issue affecting some users. We've optimized our servers and deployed a fix. The app should be much faster now. Please try again and let us know if you still experience slowness.",
      "resolution_time_hours": 8,
      "satisfaction_rating": 4
    }
  ]
}
